# layout.py

import tkinter as tk

root = tk.Tk()


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


root.geometry("200x150")

tk.Label(root, text="첫 번째 라벨 위젯", bg="red").pack()
tk.Label(root, text="두 번째 라벨 위젯", bg="green").pack()
tk.Label(root, text="세 번째 라벨 위젯", bg="yellow").pack()


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


root.mainloop()
