#include <stdio.h>

int main() {
    // 반복문
    // C언어에서 반복문은 for, while 2가지가 있음
    // 둘다 동일한 반복을 할 수 있고 약간의 차이가 있어, 편한 것을 사용하면 됨

    // for loop
    // for(초기화; 조건식; 증감/감소) {
    //      반복할 코드
    // }
    // for loop의 경우 조건식이 true일 경우 내부의 코드를 반복

    // for(int i=0; i<5; i++) {    // 5번 반복
    //     printf("%d \n", i);
    // }


    
    ///////////////////////////////////////////////////////////////////////////////////////////////////


    // while loop
    // while(조건식) {
    //     반복할 코드
    // }
    // while loop는 조건식이 true일 경우 내부의 코드를 반복

    // int x = 10;
    // while(x > 0) {
    //     printf("%d \n", x);
        
    //     x--;
    // }




    return 0;

}