// variable.js

// 변수(variable)
// 키워드 변수명 = 값;
// 위와 같은 형식으로 선언
// 키워드의 경우 var, let, const 이렇게 3가지가 있음
// var      : 중복선언 가능, 재할당 가능, 일반적인 변수를 만들때 사용, 함수 단위로 사용
// let      : 중복선언 불가능, 재할당 가능, 블록{} 단위로 사용
// const    : 중복선언 불가능, 재할당 불가능, 보통 값이 변하지 않는 경우 주로 사용, 블록{} 단위로 사용
// JS에서는 모든 코드 한줄 뒤에 새미콜론; 을 붙여야 됨

// 변수 이름 규칙
// 숫자로 시작 안됨
// 띄어쓰기 안됨
// _ 를 제외한 특수문자 불가능

// var age = 13;           // 변수를 선언하자마자 값 할당
// let my_name = "Alice";
// const height = 188;

// age = 20;               // 재할당

// var test;               // 변수 생성
// test = "cit";           // 변수에 값 할당


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// 자료형(Data Types)
// 자료형은 값의 종류
// string       문자    => 따음표로 이루어져 있음(" ", ' '), 따음표가 있으면 무조건 문자
// number       숫자    => 따음표 X, 정수, 실수 다 포함
// boolean      논리    => true, false 딱 2개만 있음
// undefined           =>  값이 저장이 안된 변수
// null         널      => 값이 없는 것

// var text = "Hello World";   // string 자료형이 저장
// var num = -3.14;            // number 자료형이 저장
// var is = true;              // boolean 자료형이 저장
// var n = null;               // null이 저장


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// 출력
// console.log(화면에 출력할 값);
// 값을 여러개 확인하기 위해서는 , (콤마) 사용

// console.log("Hello World"); // Hello World 출력

// var pi = 3.14;
// console.log(pi)

// console.log("Hello", pi);   // ,(콤마)를 사용하여 여러개를 출력


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// 자료형(data type) 확인
// typeof(값)
// typeof 값
// 위 두가지 형식 사용, typeof만 사용을 했을 경우 실행은 하지만 눈으로 자료형 확인이 불가능
// console.log() 내부에 사용하여 자료형을 눈으로 확인

// console.log(typeof(3.14));

// var t = "Hello";
// console.log(typeof t);


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// +    더하기
// -    빼기
// *    곱하기
// /    몫
// %    나머지
// **   제곱

// var a = 10;
// var b = 3;
// console.log(a + b);
// console.log(a - b);
// console.log(a * b);
// console.log(a / b);
// console.log(a % b);
// console.log(a ** b);


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// 이스케이프 코드
// 특별한 문자로 문자 출력시에 사용한다  => 따음표 기호(" ", ' ') 안에 사용
// \n   문자열 안에서 줄을 바꿀 때 사용
// \t   문자열 사이에 탭 간격을 줄 때 사용
// \\   문자 \를 그대로 표현할 때 사용
// \'   ' 를 출력
// \"   " 를 출력

// console.log("Hello \nWorld");
// console.log("아메리카노\t3,000");
// console.log("카푸치노\t4,000");
// console.log("\\ \' \"");


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //


// console.log("-------------------------------------------------------------------------------------------------");
// console.log("|\t\t\t\t\t\t|\t\t\t\t\t\t|")
// console.log("|\tCOFFE\t\t\t\t\t|\tHEALTHY TEA\t\t\t\t|");
// console.log("|\t에스프레소\t\t3.0 -\t\t|\t자몽차/레몬차/유자차\t\t3.5\t|");
// console.log("|\t카라멜마끼야또\t\t3.8 4.3\t\t|\t청포도차/대추차/생강차\t\t3.0\t|");
// console.log("|\t\t\t\t\t\t|\t\t\t\t\t\t|");
// console.log("-------------------------------------------------------------------------------------------------");

